app/controllers/ideas_controller.rb

INSERT INTO "ideas" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @idea = Idea.new idea_params
    @idea.user = current_user
    if @idea.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."idea_id" = $1 ORDER BY "reviews"."created_at" DESC  [["idea_id", 200]]
---
  def show
    @new_review = Review.new
    @reviews = @idea.reviews.order(created_at: :desc)

SELECT "ideas".* FROM "ideas" ORDER BY "ideas"."created_at" DESC
---
  def index
    @ideas = Idea.all.order(created_at: :desc)

UPDATE "ideas" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "ideas"."id" = $4  [["title", "Another new Idea man!"], ["description", "This is some more bs text that has to be long enough "], ["updated_at", "2019-03-05 01:24:14.740583"], ["id", 245]]
---
  def update
    if @idea.update idea_params

DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 242]]
---
  def destroy
    @idea.destroy

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 243], ["LIMIT", 1]]
---
  def find_idea
    @idea = Idea.find(params[:id])