app/controllers/reviews_controller.rb

  def create
    @idea = Idea.find params[:idea_id]
    @new_review = Review.new review_params
    @new_review.idea = @idea
    @new_review.user = current_user
    if @new_review.save
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 200], ["LIMIT", 1]]
INSERT INTO "reviews" ("body", "idea_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello!"], ["idea_id", 200], ["created_at", "2019-03-04 22:19:27.294993"], ["updated_at", "2019-03-04 22:19:27.294993"], ["user_id", 102]]

  def destroy
    @review = Review.find params[:id]
    if can? :destroy, @review
      @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 960], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 960]]